// Exam05.c

#include <stdio.h>

void main() {
	/*
		3차원 배열
			> 2차원 배열의 행, 열에서 면이 추가가 된 것
			int Arr[면][행][열];
			
			int Arr[2][3][4];
				> 3행 4열의 배열을 2set 만들어내는 것
				****	****
				****	****
				****	****

				*(000)*(001)*(002)*(003)	*(100)*(101)*(102)*(103)
				*(010)*(011)*(012)*(013)	*(110)*(111)*(112)*(113)
				*(020)*(021)*(022)*(023)	*(120)*(121)*(122)*(123)
	*/
	int iArr[2][2][2] = { 0, };
	
	for (int i = 0; i < 2; i++) // 면
	{
		for (int j = 0; j < 2; j++) // 행
		{
			for (int k = 0; k < 2; k++) // 열
			{
				scanf("%d", &iArr[i][j][k]);
			}
		}
	}

	for (int i = 0; i < 2; i++) // 면
	{
		for (int j = 0; j < 2; j++) // 행
		{
			for (int k = 0; k < 2; k++) // 열
			{
				printf("%d\n", iArr[i][j][k]);
			}
		}
	}
}