/*
	인구 조사
		- 반복해서 가족 구성원의 나이를 입력 받기
		 	> 0 이하의 값이 입력되면 입력 종료
		- 나이에 따라 노인/성인/청소년/아동 으로 분류하여 누적하기
		 	노인 : 65세 이상
		 	성인 : 20세~64세
		 	청소년 : 8세~19세
		 	아동 : 1세~7세
		- 아동이 3명 이상일 경우, 아동 1명당 지원금을 50만원씩 지급
		 
	[출력결과]
	<인구 조사>
	가족 구성원의 나이 입력(0 입력 시 종료) : 35
	가족 구성원의 나이 입력(0 입력 시 종료) : 33
	가족 구성원의 나이 입력(0 입력 시 종료) : 7
	가족 구성원의 나이 입력(0 입력 시 종료) : 5
	가족 구성원의 나이 입력(0 입력 시 종료) : 3
	가족 구성원의 나이 입력(0 입력 시 종료) : 1
	가족 구성원의 나이 입력(0 입력 시 종료) : 66
	가족 구성원의 나이 입력(0 입력 시 종료) : 0
	..조사 종료..
	<귀댁의 가족 구성>
	총 7명 : 노인 1명, 성인 2명, 청소년 0명, 아동 4명
	다자녀 지원금이 1000000원 지급됩니다.
*/
